{"class_name": "Model", "config": {"name": "model_4", "layers": [{"name": "input_7", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 68], "dtype": "float32", "sparse": false, "name": "input_7"}, "inbound_nodes": []}, {"name": "input_8", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "name": "input_8"}, "inbound_nodes": []}, {"name": "sequential_10", "class_name": "Sequential", "config": {"name": "sequential_10", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_10", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 26, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}}]}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "sequential_12", "class_name": "Sequential", "config": {"name": "sequential_12", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_12", "trainable": true, "batch_input_shape": [null, 4], "dtype": "float32", "input_dim": 26, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 4}}, {"class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}}]}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "dot_4", "class_name": "Dot", "config": {"name": "dot_4", "trainable": true, "axes": [2, 2], "normalize": false}, "inbound_nodes": [[["sequential_10", 1, 0, {}], ["sequential_12", 1, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dot_4", 0, 0, {}]]]}, {"name": "sequential_11", "class_name": "Sequential", "config": {"name": "sequential_11", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_11", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 26, "output_dim": 4, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}}]}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["activation_7", 0, 0, {}], ["sequential_11", 1, 0, {}]]]}, {"name": "permute_4", "class_name": "Permute", "config": {"name": "permute_4", "trainable": true, "dims": [2, 1]}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "concatenate_4", "class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "axis": -1}, "inbound_nodes": [[["permute_4", 0, 0, {}], ["sequential_12", 1, 0, {}]]]}, {"name": "bidirectional_4", "class_name": "Bidirectional", "config": {"name": "bidirectional_4", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_4", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"name": "dropout_16", "class_name": "Dropout", "config": {"name": "dropout_16", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["bidirectional_4", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "units": 26, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_16", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}], "input_layers": [["input_7", 0, 0], ["input_8", 0, 0]], "output_layers": [["activation_8", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}